In [1]:
#nlp         
import pandas as pd

In [2]:
def print_(data):
    print(data, end='\n'+'*'*30+'\n')

In [2]:
# Series - 1D Data  (Single Column)
# DataFrame - 2D Data (Tabular/Multi-Column)
# Panel - 3D Data (Multi Table Data )      # Randomly Required

In [3]:
#1. Creation/Accessing/Deletion/Manipulation
   #pd.Series([4,5,6])
   #pd.DataFrame([[3,4,5],[8,9,3]])
   #df.shape
   #df.ndim
   #s.dtype
   #df.size
   #df.values
#2. data description
   #df.info()
   #df.head()
   #df.tail()
   #df.sample(3)
   #df.describe()
   #df.value_counts()
   #s.unique()
   #s.nunique()

#3. statistical overview
   #-s.min() /df
   #-s.max() /df
   #- s.std()/df
   #-s.mean()/df
   #-df.corr()
   #-s.quantile(0.25)
   #-s.idxmax()
   #-s.idxmin()
#4. string based function
#5. joining the data 
#6. sorting
#7. function application
#8. iterations
#9. data visualization 
#10. file handling
#11. missing data treatment
#12. data aggregation & grouping

In [3]:
# Creation
s = pd.Series([90,3,59,23])
s

0    90
1     3
2    59
3    23
dtype: int64

In [4]:
# Attributes
print(type(s))
print(s.dtype)
print(s.shape)
print(s.ndim)
print(s.size)

<class 'pandas.core.series.Series'>
int64
(4,)
1
4

In [5]:
s1 = pd.Series([4,2,7,8,3,4,6,3,7,23,5,8],name = 'Data')
s1

0      4
1      2
2      7
3      8
4      3
5      4
6      6
7      3
8      7
9     23
10     5
11     8
Name: Data, dtype: int64

In [6]:
print_(s1[0]) # Accessing (Indexing)
print_(s1[:4]) # Slicing

s1[0] = 40      # Modify
print_(s1)

s1[12] = 50     # Insert
print_(s1)

del s1[5]       # Deletion
print_(s1)

4
******************************
0    4
1    2
2    7
3    8
Name: Data, dtype: int64
******************************
0     40
1      2
2      7
3      8
4      3
5      4
6      6
7      3
8      7
9     23
10     5
11     8
Name: Data, dtype: int64
******************************
0     40
1      2
2      7
3      8
4      3
5      4
6      6
7      3
8      7
9     23
10     5
11     8
12    50
Name: Data, dtype: int64
******************************
0     40
1      2
2      7
3      8
4      3
6      6
7      3
8      7
9     23
10     5
11     8
12    50
Name: Data, dtype: int64
******************************

In [7]:
s2 = pd.Series(['a','b','hi','go'])
s2

0     a
1     b
2    hi
3    go
dtype: object

In [8]:
pd.Series([[3,4,5,6],[4,6,7,3],[8,9,3,4]])

0    [3, 4, 5, 6]
1    [4, 6, 7, 3]
2    [8, 9, 3, 4]
dtype: object

In [9]:
s3 = pd.Series({'a':45,'b':67,'c':90,'d':11})
s3

a    45
b    67
c    90
d    11
dtype: int64

In [10]:
print_(s3['a'])
print_(s3[0])

45
******************************
45
******************************

In [11]:
df = pd.DataFrame([3,4,5,6])
df

   0
0  3
1  4
2  5
3  6

In [12]:
df1 = pd.DataFrame([[3,4],[5,6],[8,23]])
df1

   0   1
0  3   4
1  5   6
2  8  23

In [13]:
print_(type(df1))
print_(df1.shape)
print_(df1.size)
# print_(df1.dtype)  # can't be obtained
print_(df1.ndim)

<class 'pandas.core.frame.DataFrame'>
******************************
(3, 2)
******************************
6
******************************
2
******************************

In [14]:
df2 = pd.DataFrame({
    'a':[34,67,89],
    'b':[45,99,100],
    'c':[67,0.45,93],
    'd':[89,9,0]
})
df2

    a    b      c   d
0  34   45  67.00  89
1  67   99   0.45   9
2  89  100  93.00   0

In [15]:
df3 = pd.DataFrame({
    'a':[34,67,89],
    'b':[45,'nice',100],
    'c':[67,0.45,93],
    'd':[89,9,0],
    'e':'nice'
})
df3

    a     b      c   d     e
0  34    45  67.00  89  nice
1  67  nice   0.45   9  nice
2  89   100  93.00   0  nice

In [16]:
# Accessing
print_(df3['a']) # Column
print_(df3.loc[0]) # Row
print_(df3.T)
print_(df3.T[0])
print_(df3.loc[:3])
print_(df3[['a','b']])

# bonus
print_(df3.values)

0    34
1    67
2    89
Name: a, dtype: int64
******************************
a      34
b      45
c    67.0
d      89
e    nice
Name: 0, dtype: object
******************************
      0     1     2
a    34    67    89
b    45  nice   100
c  67.0  0.45  93.0
d    89     9     0
e  nice  nice  nice
******************************
a      34
b      45
c    67.0
d      89
e    nice
Name: 0, dtype: object
******************************
    a     b      c   d     e
0  34    45  67.00  89  nice
1  67  nice   0.45   9  nice
2  89   100  93.00   0  nice
******************************
    a     b
0  34    45
1  67  nice
2  89   100
******************************
[[34 45 67.0 89 'nice']
 [67 'nice' 0.45 9 'nice']
 [89 100 93.0 0 'nice']]
******************************

In [17]:
df3['a'] = pd.Series([9,9,99])
df3

    a     b      c   d     e
0   9    45  67.00  89  nice
1   9  nice   0.45   9  nice
2  99   100  93.00   0  nice

In [18]:
del df3['d']
df3

    a     b      c     e
0   9    45  67.00  nice
1   9  nice   0.45  nice
2  99   100  93.00  nice

In [19]:
# del df3.loc[2]  # doesn't work
df3['a']

0     9
1     9
2    99
Name: a, dtype: int64

In [20]:
df3[['a']]

    a
0   9
1   9
2  99

In [21]:
df3

    a     b      c     e
0   9    45  67.00  nice
1   9  nice   0.45  nice
2  99   100  93.00  nice

In [22]:
# Data Description
print_(df3.info())
print_(df.head(2))
print_(df.tail(3))
print_(df.sample(2))
print_(df3.describe(include='all'))
print_(df.value_counts())
print_(s3.unique())
print_(s3.nunique())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      object
 2   c       3 non-null      float64
 3   e       3 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 224.0+ bytes
None
******************************
   0
0  3
1  4
******************************
   0
1  4
2  5
3  6
******************************
   0
1  4
0  3
******************************
                a     b          c     e
count    3.000000   3.0   3.000000     3
unique        NaN   3.0        NaN     1
top           NaN  45.0        NaN  nice
freq          NaN   1.0        NaN     3
mean    39.000000   NaN  53.483333   NaN
std     51.961524   NaN  47.732597   NaN
min      9.000000   NaN   0.450000   NaN
25%      9.000000   NaN  33.725000   NaN
50%      9.000000   NaN  67.000000   NaN
75%     54.000000   NaN  80.000000   NaN
max     99.000000   NaN  93.000000   NaN
******************************
3    1
4    1
5    1
6    1
Name: count, dtype: int64
******************************
[45 67 90 11]
******************************
4
******************************

In [23]:
df.head(3)

   0
0  3
1  4
2  5

In [24]:
df.sample(4)

   0
2  5
1  4
3  6
0  3